load-tests/basic.yml
config:
  target: http://127.0.0.1:4000
  engines:
    playwright:
      launchOptions:
        headless: true
        #slowMo: 300
  processor: './mainTest.spec.cjs'
  phases:
    - duration: 2
      arrivalRate: 1
      rampTo: 1
      name: Warm up phase
    - duration: 2
      arrivalRate: 1
      rampTo: 1
      name: Ramp up load
    - duration: 2
      arrivalRate: 1
      rampTo: 1
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - name: 'playwright user flow'
    engine: playwright
    testFunction: 'mainTest'